ftkalcevic/DCC/STM32F469_Controller/Source/TouchGFX/Core/Src/main.c
  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : PrgTrk_ACK_Pin */
  GPIO_InitStruct.Pin = PrgTrk_ACK_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(PrgTrk_ACK_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : PH7 */
  GPIO_InitStruct.Pin = GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pins : Fn2_Pin Fn3_Pin */
  GPIO_InitStruct.Pin = Fn2_Pin|Fn3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : PrgTrk_Enable_Pin */
  GPIO_InitStruct.Pin = PrgTrk_Enable_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(PrgTrk_Enable_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : EncoderA_Pin */
  GPIO_InitStruct.Pin = EncoderA_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(EncoderA_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_TouchGFX_Task */
/**
  * @brief  Function implementing the TouchGFXTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header_TouchGFX_Task */
__weak void TouchGFX_Task(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_SelfTest_Task */
/**
* @brief Function implementing the SelfTestTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_SelfTest_Task */
void SelfTest_Task(void *argument)
{
  /* USER CODE BEGIN SelfTest_Task */
  vTaskDelete(NULL);
	if (HAL_GPIO_ReadPin(uSD_Detect_GPIO_Port, uSD_Detect_Pin) == GPIO_PIN_RESET) 
	{
		FRESULT res;
        printf("uSD card is present.  Root directory contents...\n");

        FATFS FatFs;
		res = f_mount(&FatFs, "0:/", 1);
		if ( res != FR_OK )
		{
			printf("Failed to mount volume - %d\n", res);
		}
		
		DIR d;
		res = f_opendir(&d, "0:/");
		if (res != FR_OK)
		{
			printf("Failed to open directory - %d\n", res);
		}
		else
		{
			FILINFO finfo;
			char filename[sizeof(finfo.fname)];
		    for(;;)
		    {
			    res = f_readdir(&d, &finfo);
			    if (res != FR_OK)
			    {
				    printf("Error reading directory %d\n", res);
				    break;
			    }
			    if (finfo.fname[0] == 0)
				    break;
			    printf("%s\n", finfo.fname);
			    strcpy(filename, finfo.fname);
		    }
			
			FIL file;
			res = f_open(&file, filename, FA_READ);
			if (res != FR_OK)
			{
				printf("Error opening file '%s' %d\n", filename, res);
			}
			else
			{
				char buffer[256];
				UINT bytesread;
				while ((res = f_read(&file, buffer, sizeof(buffer) - 1, (UINT*)&bytesread)) == FR_OK)
				{
					if (bytesread == 0)
						break;
					buffer[bytesread] = 0;
					printf(buffer);
				}
				if (res != FR_OK)
				{
					printf("Error reading file %d\n", res);
					
				}

				f_close(&file);
			}
		}
	}
	
  /* Infinite loop */
  vTaskDelete(NULL);
  /* USER CODE END SelfTest_Task */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
	else if (htim->Instance == TIM8)
	{
	    HAL_TIM_PWM_Stop(&htim8, TIM_CHANNEL_2);
	}
  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
